app_ initialization
